ERM/src/DataProcessors/UnbilledNotificationRecipientUpdate/UnbilledNotificationRecipientUpdate.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>UnbilledNotificationRecipientUpdate</name>
</mdclass:DataProcessor>

ERM/src/InformationRegisters/ПолучателиУведомленийUnbilled.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПолучателиУведомленийUnbilled</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ResponsibleAR</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EscalationLevels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LDAPUsers</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/DataProcessors/UnbilledNotificationRecipientUpdate/Forms/Форма/Module.bsl
&НаСервере
Процедура FindRecipientНаСервере()
	
	НайденныеЗаписиРегистра.Очистить();
	
	НаборЗаписей = РегистрыСведений.ПолучателиУведомленийUnbilled.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(Source) Тогда
		НаборЗаписей.Отбор.Source.Установить(Source);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Уровень) Тогда
		НаборЗаписей.Отбор.Уровень.Установить(Уровень);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Recipient) Тогда
		НаборЗаписей.Отбор.Получатель.Установить(Recipient);
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	НайденныеЗаписиРегистра.Загрузить(НаборЗаписей.Выгрузить());
	
	Для Каждого Строка Из НайденныеЗаписиРегистра Цикл
		
		Строка.ToBeChanged = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура FindRecipient(Команда)
	FindRecipientНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьПолучателяНаСервере()
	
	Если Не ЗначениеЗаполнено(NewRecipient) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("New recipient not filled!");
		Возврат;
		
	КонецЕсли;
	
	Если Не НайденныеЗаписиРегистра.Количество() = 0 Тогда
		
		//ТЗ = НайденныеЗаписиРегистра.Выгрузить( , "ToBeChanged, Source, Идентификатор1, Идентификатор2, Уровень, Получатель");
		ТЗ = НайденныеЗаписиРегистра.Выгрузить();
		
		Отбор = Новый Структура;
		Отбор.Вставить("ToBeChanged", Истина);
		
		ТЗ_Выбранные = ТЗ.Скопировать(Отбор, "Source, Идентификатор1, Идентификатор2, Уровень, Получатель");
		
		Если ТЗ_Выбранные.Количество() = 0 Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("No recipients selected!");
			
		Иначе
			
			НачатьТранзакцию();
			
			НаборЗаписей = РегистрыСведений.ПолучателиУведомленийUnbilled.СоздатьНаборЗаписей();
			
			Для Каждого СтрокаТаблицы Из ТЗ_Выбранные Цикл
				
				НаборЗаписей.Очистить();
				НаборЗаписей.Отбор.Source.Установить(СтрокаТаблицы.Source);
				НаборЗаписей.Отбор.Идентификатор1.Установить(СтрокаТаблицы.Идентификатор1);
				НаборЗаписей.Отбор.Идентификатор2.Установить(СтрокаТаблицы.Идентификатор2);
				НаборЗаписей.Отбор.Уровень.Установить(СтрокаТаблицы.Уровень);
				НаборЗаписей.Отбор.Получатель.Установить(СтрокаТаблицы.Получатель);
				НаборЗаписей.Записать();
				
				НаборЗаписей.Очистить();
				НаборЗаписей.Отбор.Source.Установить(СтрокаТаблицы.Source);
				НаборЗаписей.Отбор.Идентификатор1.Установить(СтрокаТаблицы.Идентификатор1);
				НаборЗаписей.Отбор.Идентификатор2.Установить(СтрокаТаблицы.Идентификатор2);
				НаборЗаписей.Отбор.Уровень.Установить(СтрокаТаблицы.Уровень);
				НаборЗаписей.Отбор.Получатель.Установить(NewRecipient);
				НаборЗаписей.Прочитать();
				
				НоваяЗаписьНабора = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗаписьНабора, СтрокаТаблицы, , "Получатель");
				НоваяЗаписьНабора.Получатель = NewRecipient;
				НаборЗаписей.Записать();
				
				
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("New recipient " + NewRecipient.ПолноеНаименование() + "(" + NewRecipient.Mail + ")" + " successfully set for selected fields.");
			
			ЗафиксироватьТранзакцию();
			
			FindRecipientНаСервере();
			
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("No recipients found by filter!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПолучателя(Команда)
	ИзменитьПолучателяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого СтрокаТаблицы Из НайденныеЗаписиРегистра Цикл
		Если НЕ СтрокаТаблицы.ToBeChanged Тогда
			СтрокаТаблицы.ToBeChanged = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаТаблицы Из НайденныеЗаписиРегистра Цикл
		Если СтрокаТаблицы.ToBeChanged Тогда
			СтрокаТаблицы.ToBeChanged = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
